ekawahyu/MSP430Ware/driverlib/MSP430i2xx/eusci_a_uart.c
/* --COPYRIGHT--,BSD
 * Copyright (c) 2014, Texas Instruments Incorporated
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * *  Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * *  Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * *  Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 * --/COPYRIGHT--*/
//*****************************************************************************
//
// eusci_a_uart.c - Driver for the eusci_a_uart Module.
//
//*****************************************************************************

//*****************************************************************************
//
//! \addtogroup eusci_a_uart_api
//! @{
//
//*****************************************************************************

#include "inc/hw_regaccess.h"
#include "inc/hw_memmap.h"

#ifdef __MSP430_HAS_EUSCI_Ax__
#include "eusci_a_uart.h"

#include <assert.h>

//*****************************************************************************
//
//! \brief Advanced initialization routine for the UART block. The values to be
//! written into the clockPrescalar, firstModReg, secondModReg and overSampling
//! parameters should be pre-computed and passed into the initialization
//! function.
//!
//! Upon successful initialization of the UART block, this function will have
//! initialized the module, but the UART block still remains disabled and must
//! be enabled with EUSCI_A_UART_enable(). To calculate values for
//! clockPrescalar, firstModReg, secondModReg and overSampling please use the
//! link below.
//!
//! http://software-dl.ti.com/msp430/msp430_public_sw/mcu/msp430/MSP430BaudRateConverter/index.html
//!
//! \param baseAddress is the base address of the EUSCI_A_UART module.
//! \param param is the pointer to struct for initialization.
//!
//! Modified bits are \b UCPEN, \b UCPAR, \b UCMSB, \b UC7BIT, \b UCSPB, \b
//! UCMODEx and \b UCSYNC of \b UCAxCTL0 register; bits \b UCSSELx and \b
//! UCSWRST of \b UCAxCTL1 register.
//!
//! \return STATUS_SUCCESS or STATUS_FAIL of the initialization process
//
//*****************************************************************************
bool EUSCI_A_UART_init(uint16_t baseAddress, EUSCI_A_UART_initParam *param)
{
        assert(param != 0);

        assert(
                (EUSCI_A_UART_MODE == param->uartMode) ||
                (EUSCI_A_UART_IDLE_LINE_MULTI_PROCESSOR_MODE == param->uartMode) ||
                (EUSCI_A_UART_ADDRESS_BIT_MULTI_PROCESSOR_MODE == param->uartMode) ||
                (EUSCI_A_UART_AUTOMATIC_BAUDRATE_DETECTION_MODE == param->uartMode)
                );

        assert(
                (EUSCI_A_UART_CLOCKSOURCE_ACLK == param->selectClockSource) ||
                (EUSCI_A_UART_CLOCKSOURCE_SMCLK == param->selectClockSource)
                );

        assert(
                (EUSCI_A_UART_MSB_FIRST == param->msborLsbFirst) ||
                (EUSCI_A_UART_LSB_FIRST == param->msborLsbFirst)
                );

        assert(
                (EUSCI_A_UART_ONE_STOP_BIT == param->numberofStopBits) ||
                (EUSCI_A_UART_TWO_STOP_BITS == param->numberofStopBits)
                );

        assert(
                (EUSCI_A_UART_NO_PARITY == param->parity) ||
                (EUSCI_A_UART_ODD_PARITY == param->parity) ||
                (EUSCI_A_UART_EVEN_PARITY == param->parity)
                );

        bool retVal = STATUS_SUCCESS;

        //Disable the USCI Module
        HWREG16(baseAddress + OFS_UCAxCTLW0) |= UCSWRST;

        //Clock source select
        HWREG16(baseAddress + OFS_UCAxCTLW0) &= ~UCSSEL_3;
        HWREG16(baseAddress + OFS_UCAxCTLW0) |= param->selectClockSource;

        //MSB, LSB select
        HWREG16(baseAddress + OFS_UCAxCTLW0) &= ~UCMSB;
        HWREG16(baseAddress + OFS_UCAxCTLW0) |= param->msborLsbFirst;

        //UCSPB = 0(1 stop bit) OR 1(2 stop bits)
        HWREG16(baseAddress + OFS_UCAxCTLW0) &= ~UCSPB;
        HWREG16(baseAddress + OFS_UCAxCTLW0) |= param->numberofStopBits;

        //Parity
        switch (param->parity) {
        case EUSCI_A_UART_NO_PARITY:
                //No Parity
                HWREG16(baseAddress + OFS_UCAxCTLW0) &= ~UCPEN;
                break;
        case EUSCI_A_UART_ODD_PARITY:
                //Odd Parity
                HWREG16(baseAddress + OFS_UCAxCTLW0) |= UCPEN;
                HWREG16(baseAddress + OFS_UCAxCTLW0) &= ~UCPAR;
                break;
        case EUSCI_A_UART_EVEN_PARITY:
                //Even Parity
                HWREG16(baseAddress + OFS_UCAxCTLW0) |= UCPEN;
                HWREG16(baseAddress + OFS_UCAxCTLW0) |= UCPAR;
                break;
        }

        //BaudRate Control Register
        HWREG16(baseAddress + OFS_UCAxBRW ) = param->clockPrescalar;
        //Modulation Control Register
        HWREG16(baseAddress + OFS_UCAxMCTLW) = ((param->secondModReg << 8)
                                                + (param->firstModReg << 4) + param->overSampling );

        //Asynchronous mode & 8 bit character select & clear mode
        HWREG16(baseAddress + OFS_UCAxCTLW0) &=  ~(UCSYNC +
                                                   UC7BIT +
                                                   UCMODE_3
                                                   );

        //Configure  UART mode.
        HWREG16(baseAddress + OFS_UCAxCTLW0) |= param->uartMode;

        //Reset UCRXIE, UCBRKIE, UCDORM, UCTXADDR, UCTXBRK
        HWREG16(baseAddress + OFS_UCAxCTLW0)  &= ~(UCRXEIE + UCBRKIE + UCDORM +
                                                   UCTXADDR + UCTXBRK
                                                   );

        return retVal;
}
//*****************************************************************************
//
//! \brief Transmits a byte from the UART Module.
//!
//! This function will place the supplied data into UART transmit data register
//! to start transmission
//!
//! \param baseAddress is the base address of the EUSCI_A_UART module.
//! \param transmitData data to be transmitted from the UART module
//!
//! Modified bits of \b UCAxTXBUF register.
//!
//! \return None
//
//*****************************************************************************
void EUSCI_A_UART_transmitData( uint16_t baseAddress,
                                uint8_t transmitData
                                )
{
        //If interrupts are not used, poll for flags
        if (!(HWREG16(baseAddress + OFS_UCAxIE) & UCTXIE))
                //Poll for transmit interrupt flag
                while (!(HWREG16(baseAddress + OFS_UCAxIFG) & UCTXIFG)) ;

        HWREG16(baseAddress + OFS_UCAxTXBUF) = transmitData;
}

//*****************************************************************************
//
//! \brief Receives a byte that has been sent to the UART Module.
//!
//! This function reads a byte of data from the UART receive data Register.
//!
//! \param baseAddress is the base address of the EUSCI_A_UART module.
//!
//! Modified bits of \b UCAxRXBUF register.
//!
//! \return Returns the byte received from by the UART module, cast as an
//!         uint8_t.
//
//*****************************************************************************
uint8_t EUSCI_A_UART_receiveData(uint16_t baseAddress)
{
        //If interrupts are not used, poll for flags
        if (!(HWREG16(baseAddress + OFS_UCAxIE) & UCRXIE))
                //Poll for receive interrupt flag
                while (!(HWREG16(baseAddress + OFS_UCAxIFG) & UCRXIFG)) ;

        return HWREG16(baseAddress + OFS_UCAxRXBUF);
}

//*****************************************************************************
//
//! \brief Enables individual UART interrupt sources.
//!
//! Enables the indicated UART interrupt sources.  The interrupt flag is first
//! and then the corresponding interrupt is enabled. Only the sources that are
//! enabled can be reflected to the processor interrupt; disabled sources have
//! no effect on the processor. Does not clear interrupt flags.
//!
//! \param baseAddress is the base address of the EUSCI_A_UART module.
//! \param mask is the bit mask of the interrupt sources to be enabled.
//!        Mask value is the logical OR of any of the following:
//!        - \b EUSCI_A_UART_RECEIVE_INTERRUPT - Receive interrupt
//!        - \b EUSCI_A_UART_TRANSMIT_INTERRUPT - Transmit interrupt
//!        - \b EUSCI_A_UART_RECEIVE_ERRONEOUSCHAR_INTERRUPT - Receive
//!           erroneous-character interrupt enable
//!        - \b EUSCI_A_UART_BREAKCHAR_INTERRUPT - Receive break character
//!           interrupt enable
//!        - \b EUSCI_A_UART_STARTBIT_INTERRUPT - Start bit received interrupt
//!           enable
//!        - \b EUSCI_A_UART_TRANSMIT_COMPLETE_INTERRUPT - Transmit complete
//!           interrupt enable
//!
//! Modified bits of \b UCAxCTL1 register and bits of \b UCAxIE register.
//!
//! \return None
//
//*****************************************************************************
void EUSCI_A_UART_enableInterrupt(uint16_t baseAddress,
                                  uint8_t mask
                                  )
{
        assert(!(mask & ~(EUSCI_A_UART_RECEIVE_INTERRUPT
                          | EUSCI_A_UART_TRANSMIT_INTERRUPT
                          | EUSCI_A_UART_RECEIVE_ERRONEOUSCHAR_INTERRUPT
                          | EUSCI_A_UART_BREAKCHAR_INTERRUPT
                          | EUSCI_A_UART_STARTBIT_INTERRUPT
                          | EUSCI_A_UART_TRANSMIT_COMPLETE_INTERRUPT)));

        uint8_t locMask;

        locMask = (mask & (EUSCI_A_UART_RECEIVE_INTERRUPT
                           | EUSCI_A_UART_TRANSMIT_INTERRUPT
                           | EUSCI_A_UART_STARTBIT_INTERRUPT
                           | EUSCI_A_UART_TRANSMIT_COMPLETE_INTERRUPT));

        HWREG16(baseAddress + OFS_UCAxIE) |= locMask;

